Tekla Open API Reference for Tekla Structures 2025
RadialGrid.IsMagnetic Property
 Gets or sets whether the grid is magnetic or not
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool IsMagnetic { get; set; }
Public Overrides Property IsMagnetic As Boolean
	Get
	Set
Property Value
Type: Boolean
Exceptions
Exception | Condition
NotImplementedException | Throws on set property to true. Radial grids do not support magnetic property
Remarks
Returns always false. Property cannot be set to true since it does not support the magnetic property
See Also
Reference
RadialGrid Class
Tekla.Structures.Model Namespace